tap "microsoft/mssql-release"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Post-modern modal text editor
brew "helix"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Improved top (interactive process viewer)
brew "htop"
# Apple Silicon Monitor Top written in Golang
brew "mactop"
# Mac App Store command-line interface
brew "mas"
# General-purpose data compression with high compression ratio
brew "xz"
# Platform built on V8 to build network applications
brew "node"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Cross-shell prompt for astronauts
brew "starship"
# Stress test a computer system in various selectable ways
brew "stress-ng"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Feature-rich syntax highlighting for Zsh
brew "zsh-fast-syntax-highlighting"
# ODBC Driver for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/msodbcsql17"
# ODBC Driver for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/msodbcsql18"
# Sqlcmd and Bcp for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/mssql-tools"
# Sqlcmd and Bcp for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/mssql-tools18"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Display management tool
cask "betterdisplay"
# Scriptable scratchpad for developers
cask "boop"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Disk space visualiser
cask "daisydisk"
# Database version management tool
cask "dbngin"
# Web browser
cask "firefox"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"               # Terminal
cask "font-jetbrains-mono-nerd-font"  # Font for iTerm2 + VS Code
# JetBrains tools manager
cask "jetbrains-toolbox"
# Automatically ejects external drives
cask "jettison"
# Menu bar manager
cask "jordanbaird-ice"
# Blocks all Keyboard and TouchBar input
cask "keyboardcleantool"
# Create, manage and debug system and user services
cask "launchcontrol"
# Screen and video recording software
cask "loom"
# Clipboard manager
cask "maccy"
# Multi-platform web browser
cask "microsoft-edge"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Scriptable JSON formatter and editor
cask "ok-json"
# Desktop virtualization software
cask "parallels"
# Collaboration platform for API development
cask "postman"
# Command-line shell and scripting language
cask "powershell"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# Open-source code editor
cask "visual-studio-code"
# Connect to Windows
cask "windows-app"
mas "1Blocker", id: 1365531024
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Bandwidth+", id: 490461369
mas "Gifski", id: 1351639930
mas "Mela", id: 1568924476
mas "Perplexity", id: 6714467650
mas "Presentify", id: 1507246666
mas "Xcode", id: 497799835
